tutorials/cavityFSI/fluid/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

solver ElRBFMeshMotionSolver;

movingPatches ( bottomWall );

staticPatches ( inlet outlet movingWall fixedWalls );

coarseningStrategy AdaptiveCoarsening;

interpolation
{
  function TPS;
}

AdaptiveCoarsening
{
    tol 1e-3;
    reselectionTol 1e-2;
    minPoints 100;
    maxPoints 500;
}
