tutorials/cavityFSI/fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
  default bdf2;
}

gradSchemes
{
  default Gauss linear ;
}

divSchemes
{
  default none;
  div(phi,U) Gauss skewCorrected linear; 
  div((nuEff*dev(grad(U).T()))) Gauss linear;
  div(U) Gauss linear;
}

laplacianSchemes
{
  default Gauss linear corrected ;
}

interpolationSchemes
{
  default skewCorrected linear ;
}

snGradSchemes
{
  default corrected;
} 

fluxRequired
{
  default no;
  p;
}
